;-----------------------------------------------------------------
; 循环十次，测试结构相关
;-----------------------------------------------------------------
      LHI      R2, (A>>16)&0xFFFF   ; 载入A的高16位到R2高16位
      ADDUI    R2, R2, A&0xFFFF     ; 无符号立即数加A的低十六位
      LHI      R3, (B>>16)&0xFFFF   ; B的高16位到R3的高16位
      ADDUI    R3, R3, B&0xFFFF     ; 无符号立即数加B的低十六位
      ADDU     R4, R0, R3           ; R4 = R0 + R3，即等于B的地址
loop:  
      LD     F0, 0(R2)              ; F0 = A[0]
      LD     F4, 0(R3)              ; F4 = B[0]
      ADDD   F0, F0, F4             ; F0 = F0 + F4
      ADDD   F2, F0, F2             ; F2 = F0 + F2,存在译码器的结构相关
      ADDI   R2, R2, #8             ; r2 指向下个单元,存在译码器、存储器的结构相关
      ADDI   R3, R3, #8             ; r3 指向下个单元,存在ALU的结构相关冲突
      SUB    R5, R4, R2             ; r5 = r4 - r2,存在译码部件结构相关
      BNEZ   R5, loop               ; R5 = 0 时退出循环，否则继续loop
      TRAP   #0                     ; Exit <- this is a comment !! 
A:    .double 1, 2, 3, 4, 5, 6, 7, 8, 9, 10  
B:    .double 1, 2, 3, 4, 5, 6, 7, 8, 9, 10  
